# Pregunta 1: Pandas

In [0]:
import pandas as pd 
import io

from google.colab import files
uploaded = files.upload()

print("Listo!")

Saving usuarios.csv to usuarios.csv
Saving productos.csv to productos.csv
Saving compras.csv to compras.csv
Listo!

In [0]:
df_usuarios = pd.read_csv(io.BytesIO(uploaded['usuarios.csv']))
df_compras = pd.read_csv(io.BytesIO(uploaded['compras.csv']))
df_productos = pd.read_csv(io.BytesIO(uploaded['productos.csv']))

In [0]:
df_usuarios.head()

   uid     nombre  edad
0    1     Tamara    25
1    2  Constanza    24
2    3     Adrián    26
3    4  Sebastián    70
4    5      Jaime    16

In [0]:
df_usuarios[["nombre","edad"]]

      nombre  edad
0     Tamara    25
1  Constanza    24
2     Adrián    26
3  Sebastián    70
4      Jaime    16

In [0]:
df_productos.head()

   pid                    nombre  precio
0    1  Pack de Cervezas Premium   18990
1    2                 Té Matcha    8990
2    3          Promo de Malpaso    7990
3    4   Vino Cartoné SuBidón 2L    1990
4    5        Hierbas saludables   10000

In [0]:
df_compras.head()

   uid  pid  cid  cantidad
0    1    1    1         2
1    3    2    2         5
2    2    3    3         1
3    3    1    4         2
4    1    4    5         3

## Obtener a todos los usuarios que tienen entre 18 y 50 años

In [0]:
join1 = pd.merge()

In [0]:
aux0 = df_usuarios[["nombre","edad"]]
aux0

      nombre  edad
0     Tamara    25
1  Constanza    24
2     Adrián    26
3  Sebastián    70
4      Jaime    16

In [0]:
aux0.query('edad > 18 and edad < 50')

      nombre  edad
0     Tamara    25
1  Constanza    24
2     Adrián    26

In [0]:
aux = df_usuarios.query('edad > 18 and edad < 50')
aux[["nombre","edad"]]

      nombre  edad
0     Tamara    25
1  Constanza    24
2     Adrián    26

In [0]:
df_usuarios

   uid     nombre  edad
0    1     Tamara    25
1    2  Constanza    24
2    3     Adrián    26
3    4  Sebastián    70
4    5      Jaime    16

In [0]:
df_usuarios18 = df_usuarios[df_usuarios.edad > 18]
df_usuarios50 = df_usuarios[df_usuarios.edad < 50]

inter_df = pd.merge(df_usuarios18, df_usuarios50, how='inner')
inter_df

   uid     nombre  edad
0    1     Tamara    25
1    2  Constanza    24
2    3     Adrián    26

## Obtener el nombre de usuario junto a todos los productos que ha comprado

In [0]:
user_compras = pd.merge(df_usuarios, df_compras, how="inner")
user_compras

   uid     nombre  edad  pid  cid  cantidad
0    1     Tamara    25    1    1         2
1    1     Tamara    25    4    5         3
2    2  Constanza    24    3    3         1
3    3     Adrián    26    2    2         5
4    3     Adrián    26    1    4         2

In [0]:
df_productos

   pid                    nombre  precio
0    1  Pack de Cervezas Premium   18990
1    2                 Té Matcha    8990
2    3          Promo de Malpaso    7990
3    4   Vino Cartoné SuBidón 2L    1990
4    5        Hierbas saludables   10000

In [0]:
prod_user_compras = pd.merge(user_compras, df_productos, how="inner", on="pid")
prod_user_compras

   uid   nombre_x  edad  pid  cid  cantidad                  nombre_y  precio
0    1     Tamara    25    1    1         2  Pack de Cervezas Premium   18990
1    3     Adrián    26    1    4         2  Pack de Cervezas Premium   18990
2    1     Tamara    25    4    5         3   Vino Cartoné SuBidón 2L    1990
3    2  Constanza    24    3    3         1          Promo de Malpaso    7990
4    3     Adrián    26    2    2         5                 Té Matcha    8990

In [0]:
prod_user_compras[["nombre_x", "nombre_y"]]

    nombre_x                  nombre_y
0     Tamara  Pack de Cervezas Premium
1     Adrián  Pack de Cervezas Premium
2     Tamara   Vino Cartoné SuBidón 2L
3  Constanza          Promo de Malpaso
4     Adrián                 Té Matcha

## Obtener el total de dinero que ha gastado cada persona

In [0]:
total_compra = prod_user_compras.cantidad * prod_user_compras.precio

prod_user_compras["total"] = total_compra

In [0]:
prod_user_compras

   uid   nombre_x  edad  pid  ...  cantidad                  nombre_y precio  total
0    1     Tamara    25    1  ...         2  Pack de Cervezas Premium  18990  37980
1    3     Adrián    26    1  ...         2  Pack de Cervezas Premium  18990  37980
2    1     Tamara    25    4  ...         3   Vino Cartoné SuBidón 2L   1990   5970
3    2  Constanza    24    3  ...         1          Promo de Malpaso   7990   7990
4    3     Adrián    26    2  ...         5                 Té Matcha   8990  44950

[5 rows x 9 columns]

In [0]:
aux = prod_user_compras[["nombre_x","total"]]

In [0]:
aux.groupby(['nombre_x']).sum()

           total
nombre_x
Adrián     82930
Constanza   7990
Tamara     43950

In [0]:
prod_user_compras[['uid','nombre_x','total']].groupby(['uid','nombre_x']).sum()

               total
uid nombre_x
1   Tamara     43950
2   Constanza   7990
3   Adrián     82930